app/Views/templates/sidebar.php

<?php
$permissionModel = new \App\Models\permissionModel();
$role = $permissionModel->WHERE('rolename',session()->get('role'))->first();
//count the pending
$reviewModel = new \App\Models\reviewModel();
$pending = $reviewModel->where('status', '0')->WHERE('accountID',session()->get('loggedUser'))->countAllResults();
---
SELECT *
FROM `user_permissions`
WHERE `rolename` = 'Editor'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `reviews`
WHERE `status` = '0'
AND `accountID` = '7'