app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `request`
SELECT COUNT(*) AS `numrows`
FROM `request`
WHERE `status` = 0
SELECT COUNT(*) AS `numrows`
FROM `request`
WHERE `status` = 1
SELECT COUNT(*) AS `numrows`
FROM `request`
WHERE `status` = 3
SELECT `b`.`warehouseName`, SUM(CASE WHEN a.status IN (0, 1) THEN 1 ELSE 0 END) AS review, SUM(CASE WHEN a.status = 3 THEN 1 ELSE 0 END) AS close, COUNT(a.request_id) AS total
FROM `request` `a`
LEFT JOIN `tblwarehouse` `b` ON `b`.`warehouseID` = `a`.`from`
GROUP BY `a`.`from`, `b`.`warehouseName`
ORDER BY `a`.`from` ASC
SELECT *
FROM `request`
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function dashboard()
    {
        $title = "Dashboard";
        //get the total of pending request
        $requestModel = model('App\Models\RequestModel');
        //get the total of request
        $total = $requestModel->countAllResults();
        $pending = $requestModel->WHERE('status',0)->countAllResults();
        //get the total of review request
        $review = $requestModel->WHERE('status',1)->countAllResults();
        //get the total of closed request
        $close = $requestModel->WHERE('status',3)->countAllResults();
        //chart
        $builder = $this->db->table('request a');
        $builder->select('
            b.warehouseName,
            SUM(CASE WHEN a.status IN (0, 1) THEN 1 ELSE 0 END) AS review,
            SUM(CASE WHEN a.status = 3 THEN 1 ELSE 0 END) AS close,
            COUNT(a.request_id) AS total
        ');
        $builder->join('tblwarehouse b', 'b.warehouseID = a.from', 'LEFT');
        $builder->groupBy('a.from, b.warehouseName'); // Best practice to group by all selected non-aggregated columns
        $builder->orderBy('a.from', 'ASC');
        $records = $builder->get()->getResultArray();
        //list
        $list = $requestModel->orderBy('created_at', 'DESC')
                    ->limit(5)
                    ->findAll();

SELECT *
FROM `user_permissions`
WHERE `rolename` = 'Administrator'
 LIMIT 1
SELECT `b`.*, `c`.`warehouseName`
FROM `reviews` `a`
LEFT JOIN `request` `b` ON `b`.`control_number`=`a`.`control_number`
LEFT JOIN `tblwarehouse` `c` ON `c`.`warehouseID`=`b`.`from`
WHERE `a`.`accountID` = '5'
AND `b`.`status` = 3
GROUP BY `a`.`review_id`
---
    public function Review()
    {
        $permissionModel = new \App\Models\permissionModel();
        $role = $permissionModel->WHERE('rolename',session()->get('role'))->first();
        if($role['approval']==1)
        {
            $title = "Review";
            //get the completed request
            $builder = $this->db->table('reviews a');
            $builder->select('b.*,c.warehouseName');
            $builder->join('request b','b.control_number=a.control_number','LEFT');
            $builder->join('tblwarehouse c','c.warehouseID=b.from','LEFT');
            $builder->WHERE('a.accountID',session()->get('loggedUser'));
            $builder->WHERE('b.status',3); //closed request
            $builder->groupBy('a.review_id');
            $records = $builder->get()->getResult();

SELECT *
FROM `user_permissions`
WHERE `rolename` = 'Administrator'
 LIMIT 1
SELECT *
FROM `tblwarehouse`
---
    public function reports()
    {
        $permissionModel = new \App\Models\permissionModel();
        $role = $permissionModel->WHERE('rolename',session()->get('role'))->first();
        if($role['reports']==1)
        {
            $title = "Reports";
            //get the list of ports, vessels and offices
            $builder = $this->db->table('tblwarehouse');
            $builder->select('*');
            $office = $builder->get()->getResult();