app/Controllers/Save.php

    public function fetchCodes()
    {
        $searchTerm = $_GET['search']['value'] ?? '';
        $codeModel = new \App\Models\codeModel();
        $builder = $this->db->table('codes a');
        $builder->select('a.*,b.warehouseName');
        $builder->join('tblwarehouse b','b.warehouseID=a.warehouse_id','INNER');
        $builder->groupBy('a.code_id');

        if($searchTerm)
        {
            $builder->groupStart()->LIKE('a.code',$searchTerm)->orLike('b.warehouseName',$searchTerm)->groupEnd();
        }
        $codes = $builder->get()->getResult();
        $filteredRecords = count($codes);
        $totalRecords = $codeModel->countAllResults();
---
SELECT `a`.*, `b`.`warehouseName`
FROM `codes` `a`
INNER JOIN `tblwarehouse` `b` ON `b`.`warehouseID`=`a`.`warehouse_id`
GROUP BY `a`.`code_id`
SELECT COUNT(*) AS `numrows`
FROM `codes`

    public function incomingRequest()
    {
        $searchTerm = $_GET['search']['value'] ?? '';
        $requestModel = new \App\Models\requestModel();
        $builder = $this->db->table('request a');
        $builder->select('b.created_at,b.updated_at,a.control_number,b.remarks,b.status,b.review_id');
        $builder->join('reviews b','b.control_number=a.control_number','LEFT');
        $builder->WHERE('b.status',0); // Assuming 0 is the status for pending requests
        $builder->WHERE('b.accountID',session()->get('loggedUser'));
        $builder->groupBy('b.review_id',);

         if($searchTerm)
        {
            $builder->groupStart()->LIKE('a.control_number',$searchTerm)->groupEnd();
        }
        $result = $builder->get()->getResult();
        $filteredRecords = count($result);
        $totalRecords = $requestModel->countAllResults();
---
SELECT `b`.`created_at`, `b`.`updated_at`, `a`.`control_number`, `b`.`remarks`, `b`.`status`, `b`.`review_id`
FROM `request` `a`
LEFT JOIN `reviews` `b` ON `b`.`control_number`=`a`.`control_number`
WHERE `b`.`status` = 0
AND `b`.`accountID` = '5'
GROUP BY `b`.`review_id`
SELECT COUNT(*) AS `numrows`
FROM `request`

    public function processRequest()
    {
        $searchTerm = $_GET['search']['value'] ?? '';
        $requestModel = new \App\Models\requestModel();
        $builder = $this->db->table('request a');
        $builder->select('a.*,c.warehouseName,d.file');
        $builder->join('reviews b','b.control_number=a.control_number','LEFT');
        $builder->join('tblwarehouse c','c.warehouseID=a.from','INNER');
        $builder->join('files d','d.request_id=a.request_id','LEFT');
        $builder->WHERENOTIN('a.status',[0,3]);
        $builder->WHERE('b.accountID',session()->get('loggedUser'));
        $builder->groupBy('b.review_id',);

         if($searchTerm)
        {
            $builder->groupStart()->LIKE('a.control_number',$searchTerm)->orLIKE('c.warehouseName',$searchTerm)->groupEnd();
        }
        $result = $builder->get()->getResult();
        $filteredRecords = count($result);
        $totalRecords = $requestModel->countAllResults();
---
SELECT `a`.*, `c`.`warehouseName`, `d`.`file`
FROM `request` `a`
LEFT JOIN `reviews` `b` ON `b`.`control_number`=`a`.`control_number`
INNER JOIN `tblwarehouse` `c` ON `c`.`warehouseID`=`a`.`from`
LEFT JOIN `files` `d` ON `d`.`request_id`=`a`.`request_id`
WHERE `a`.`status` NOT IN (0,3)
AND `b`.`accountID` = '5'
GROUP BY `b`.`review_id`
SELECT COUNT(*) AS `numrows`
FROM `request`

    public function fetchRequest()
    {
        $permissionModel = new \App\Models\permissionModel();
        $role = $permissionModel->WHERE('rolename',session()->get('role'))->first();
        if($role['approval']==1){
            $val = $this->request->getGet('value');
            $requestModel = new \App\Models\requestModel();
            $data = $requestModel->WHERE('request_id',$val)->first();
            if ($data) {
                $warehouseModel = new \App\Models\warehouseModel();
                $warehouse = $warehouseModel->WHERE('warehouseID',$data['from'])->first();
---
SELECT *
FROM `user_permissions`
WHERE `rolename` = 'Administrator'
 LIMIT 1
SELECT *
FROM `request`
WHERE `request_id` = '3'
 LIMIT 1

                $output .= '<div class="card-body">
                                <div class="row g-3">';
                $itemModel = new \App\Models\itemModel();
                $items = $itemModel->WHERE('request_id',$data['request_id'])->findAll();
---
SELECT *
FROM `items`
WHERE `request_id` = '3'

                $output .= '</div></div>';
                //review
                $reviewModel = new \App\Models\reviewModel();
                $review = $reviewModel->WHERE('control_number',$data['control_number'])->first();
---
SELECT *
FROM `reviews`
WHERE `control_number` = 'CAL-D/PRWRF-2025-002'
 LIMIT 1

    public function acceptRequest()
    {
        $permissionModel = new \App\Models\permissionModel();
        $role = $permissionModel->WHERE('rolename',session()->get('role'))->first();
---
SELECT *
FROM `user_permissions`
WHERE `rolename` = 'Administrator'
 LIMIT 1

    public function viewRequest()
    {
        $permissionModel = new \App\Models\permissionModel();
        $role = $permissionModel->WHERE('rolename',session()->get('role'))->first();
        if($role['approval']==1)
        {
            $val = $this->request->getGet('value');
            $requestModel = new \App\Models\requestModel();
            $data = $requestModel->WHERE('request_id',$val)->first();
---
SELECT *
FROM `user_permissions`
WHERE `rolename` = 'Administrator'
 LIMIT 1
SELECT *
FROM `request`
WHERE `request_id` = '2'
 LIMIT 1

                $output .= '<div class="card-body">
                                <div class="row g-3">';
                $itemModel = new \App\Models\itemModel();
                $items = $itemModel->WHERE('request_id',$data['request_id'])->findAll();
---
SELECT *
FROM `items`
WHERE `request_id` = '2'

    public function editStatus()
    {
        $permissionModel = new \App\Models\permissionModel();
        $role = $permissionModel->WHERE('rolename',session()->get('role'))->first();
        if($role['approval']==1)
        {
            $requestModel = new \App\Models\requestModel();
            $systemLogsModel = new \App\Models\systemLogsModel();
            $val = $this->request->getPost('request_id');
            $status = $this->request->getPost('status');
            if(empty($val) || !is_numeric($val))
            {
                echo "Invalid Request";
            }
            else
            {

                $record = $requestModel->WHERE('request_id',$val)->first();
                //update the status of the request and review
                $data = ['status'=>$status];
                $requestModel->update($record['request_id'],$data);
                //logs
                $values = ['accountID'=>session()->get('loggedUser'),'Date'=>date('Y-m-d H:i:s a'),'Activity'=>'Modify the status of D/PRWRF : '.$record['control_number']];
---
SELECT *
FROM `request`
WHERE `request_id` = '4'
 LIMIT 1

    public function fetchReport()
    {
        $from = $this->request->getGet('from');
        if(empty($from)|| !is_numeric($from))
        {
            echo "<tr><td colspan='5' class='text-center'>No Record(s) found</td></tr>";
        }
        else
        {
            $output="";
            $requestModel = new \App\Models\requestModel();
            $records = $requestModel->WHERE('from',$from)->findAll();
---
SELECT *
FROM `request`
WHERE `from` = '5'