app/Controllers/Save.php

    public function editStatus()
    {
        $permissionModel = new \App\Models\permissionModel();
        $role = $permissionModel->WHERE('rolename',session()->get('role'))->first();
        if($role['approval']==1)
        {
            $requestModel = new \App\Models\requestModel();
            $systemLogsModel = new \App\Models\systemLogsModel();
            $val = $this->request->getPost('request_id');
            $status = $this->request->getPost('status');
            if(empty($val) || !is_numeric($val))
            {
                echo "Invalid Request";
            }
            else
            {

                $record = $requestModel->WHERE('request_id',$val)->first();
                //update the status of the request and review
                $data = ['status'=>$status];
                $requestModel->update($record['request_id'],$data);
---
SELECT *
FROM `user_permissions`
WHERE `rolename` = 'Editor'
 LIMIT 1
UPDATE `request` SET `status` = '3', `updated_at` = '2025-07-25 06:12:12'
WHERE `request`.`request_id` IN ('4')